Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/emac.h
/**
 * \brief Component description for EMAC
 *
 * Copyright (c) 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-02-20T18:44:00Z */
#ifndef _SAM9X_EMAC_COMPONENT_H_
#define _SAM9X_EMAC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR EMAC                                         */
/* ************************************************************************** */

/* -------- EMAC_SAxB : (EMAC Offset: 0x00) (R/W 32) Specific Address X Bottom Register -------- */
#define EMAC_SAxB_ADDR_Pos                    _U_(0)                                               /**< (EMAC_SAxB) Specific Address X Bottom Position */
#define EMAC_SAxB_ADDR_Msk                    (_U_(0xFFFFFFFF) << EMAC_SAxB_ADDR_Pos)              /**< (EMAC_SAxB) Specific Address X Bottom Mask */
#define EMAC_SAxB_ADDR(value)                 (EMAC_SAxB_ADDR_Msk & ((value) << EMAC_SAxB_ADDR_Pos))
#define EMAC_SAxB_Msk                         _U_(0xFFFFFFFF)                                      /**< (EMAC_SAxB) Register Mask  */


/* -------- EMAC_SAxT : (EMAC Offset: 0x04) (R/W 32) Specific Address X Top Register -------- */
#define EMAC_SAxT_ADDR_Pos                    _U_(0)                                               /**< (EMAC_SAxT) Specific Address X Top Position */
#define EMAC_SAxT_ADDR_Msk                    (_U_(0xFFFF) << EMAC_SAxT_ADDR_Pos)                  /**< (EMAC_SAxT) Specific Address X Top Mask */
#define EMAC_SAxT_ADDR(value)                 (EMAC_SAxT_ADDR_Msk & ((value) << EMAC_SAxT_ADDR_Pos))
#define EMAC_SAxT_Msk                         _U_(0x0000FFFF)                                      /**< (EMAC_SAxT) Register Mask  */


/* -------- EMAC_NCR : (EMAC Offset: 0x00) (R/W 32) Network Control Register -------- */
#define EMAC_NCR_LB_Pos                       _U_(0)                                               /**< (EMAC_NCR) LoopBack Position */
#define EMAC_NCR_LB_Msk                       (_U_(0x1) << EMAC_NCR_LB_Pos)                        /**< (EMAC_NCR) LoopBack Mask */
#define EMAC_NCR_LB(value)                    (EMAC_NCR_LB_Msk & ((value) << EMAC_NCR_LB_Pos))    
#define EMAC_NCR_LLB_Pos                      _U_(1)                                               /**< (EMAC_NCR) Loopback Local Position */
#define EMAC_NCR_LLB_Msk                      (_U_(0x1) << EMAC_NCR_LLB_Pos)                       /**< (EMAC_NCR) Loopback Local Mask */
#define EMAC_NCR_LLB(value)                   (EMAC_NCR_LLB_Msk & ((value) << EMAC_NCR_LLB_Pos))  
#define EMAC_NCR_RE_Pos                       _U_(2)                                               /**< (EMAC_NCR) Receive Enable Position */
#define EMAC_NCR_RE_Msk                       (_U_(0x1) << EMAC_NCR_RE_Pos)                        /**< (EMAC_NCR) Receive Enable Mask */
#define EMAC_NCR_RE(value)                    (EMAC_NCR_RE_Msk & ((value) << EMAC_NCR_RE_Pos))    
#define EMAC_NCR_TE_Pos                       _U_(3)                                               /**< (EMAC_NCR) Transmit Enable Position */
#define EMAC_NCR_TE_Msk                       (_U_(0x1) << EMAC_NCR_TE_Pos)                        /**< (EMAC_NCR) Transmit Enable Mask */
#define EMAC_NCR_TE(value)                    (EMAC_NCR_TE_Msk & ((value) << EMAC_NCR_TE_Pos))    
#define EMAC_NCR_MPE_Pos                      _U_(4)                                               /**< (EMAC_NCR) Management Port Enable Position */
#define EMAC_NCR_MPE_Msk                      (_U_(0x1) << EMAC_NCR_MPE_Pos)                       /**< (EMAC_NCR) Management Port Enable Mask */
#define EMAC_NCR_MPE(value)                   (EMAC_NCR_MPE_Msk & ((value) << EMAC_NCR_MPE_Pos))  
#define EMAC_NCR_CLRSTAT_Pos                  _U_(5)                                               /**< (EMAC_NCR) Clear Statistics Registers Position */
#define EMAC_NCR_CLRSTAT_Msk                  (_U_(0x1) << EMAC_NCR_CLRSTAT_Pos)                   /**< (EMAC_NCR) Clear Statistics Registers Mask */
#define EMAC_NCR_CLRSTAT(value)               (EMAC_NCR_CLRSTAT_Msk & ((value) << EMAC_NCR_CLRSTAT_Pos))
#define EMAC_NCR_INCSTAT_Pos                  _U_(6)                                               /**< (EMAC_NCR) Increment Statistics Registers Position */
#define EMAC_NCR_INCSTAT_Msk                  (_U_(0x1) << EMAC_NCR_INCSTAT_Pos)                   /**< (EMAC_NCR) Increment Statistics Registers Mask */
#define EMAC_NCR_INCSTAT(value)               (EMAC_NCR_INCSTAT_Msk & ((value) << EMAC_NCR_INCSTAT_Pos))
#define EMAC_NCR_WESTAT_Pos                   _U_(7)                                               /**< (EMAC_NCR) Write Enable for Statistics Registers Position */
#define EMAC_NCR_WESTAT_Msk                   (_U_(0x1) << EMAC_NCR_WESTAT_Pos)                    /**< (EMAC_NCR) Write Enable for Statistics Registers Mask */
#define EMAC_NCR_WESTAT(value)                (EMAC_NCR_WESTAT_Msk & ((value) << EMAC_NCR_WESTAT_Pos))
#define EMAC_NCR_BP_Pos                       _U_(8)                                               /**< (EMAC_NCR) Back Pressure Position */
#define EMAC_NCR_BP_Msk                       (_U_(0x1) << EMAC_NCR_BP_Pos)                        /**< (EMAC_NCR) Back Pressure Mask */
#define EMAC_NCR_BP(value)                    (EMAC_NCR_BP_Msk & ((value) << EMAC_NCR_BP_Pos))    
#define EMAC_NCR_TSTART_Pos                   _U_(9)                                               /**< (EMAC_NCR) Start Transmission Position */
#define EMAC_NCR_TSTART_Msk                   (_U_(0x1) << EMAC_NCR_TSTART_Pos)                    /**< (EMAC_NCR) Start Transmission Mask */
#define EMAC_NCR_TSTART(value)                (EMAC_NCR_TSTART_Msk & ((value) << EMAC_NCR_TSTART_Pos))
#define EMAC_NCR_THALT_Pos                    _U_(10)                                              /**< (EMAC_NCR) Transmit Halt Position */
#define EMAC_NCR_THALT_Msk                    (_U_(0x1) << EMAC_NCR_THALT_Pos)                     /**< (EMAC_NCR) Transmit Halt Mask */
#define EMAC_NCR_THALT(value)                 (EMAC_NCR_THALT_Msk & ((value) << EMAC_NCR_THALT_Pos))
#define EMAC_NCR_TPFR_Pos                     _U_(11)                                              /**< (EMAC_NCR) Transmit Pause Frame Position */
#define EMAC_NCR_TPFR_Msk                     (_U_(0x1) << EMAC_NCR_TPFR_Pos)                      /**< (EMAC_NCR) Transmit Pause Frame Mask */
#define EMAC_NCR_TPFR(value)                  (EMAC_NCR_TPFR_Msk & ((value) << EMAC_NCR_TPFR_Pos))
#define EMAC_NCR_TZQ_Pos                      _U_(12)                                              /**< (EMAC_NCR) Transmit Zero Quantum Pause Frame Position */
#define EMAC_NCR_TZQ_Msk                      (_U_(0x1) << EMAC_NCR_TZQ_Pos)                       /**< (EMAC_NCR) Transmit Zero Quantum Pause Frame Mask */
#define EMAC_NCR_TZQ(value)                   (EMAC_NCR_TZQ_Msk & ((value) << EMAC_NCR_TZQ_Pos))  
#define EMAC_NCR_Msk                          _U_(0x00001FFF)                                      /**< (EMAC_NCR) Register Mask  */


