Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/emac.h
/* -------- EMAC_NCFGR : (EMAC Offset: 0x04) (R/W 32) Network Configuration Register -------- */
#define EMAC_NCFGR_SPD_Pos                    _U_(0)                                               /**< (EMAC_NCFGR) Speed Position */
#define EMAC_NCFGR_SPD_Msk                    (_U_(0x1) << EMAC_NCFGR_SPD_Pos)                     /**< (EMAC_NCFGR) Speed Mask */
#define EMAC_NCFGR_SPD(value)                 (EMAC_NCFGR_SPD_Msk & ((value) << EMAC_NCFGR_SPD_Pos))
#define EMAC_NCFGR_FD_Pos                     _U_(1)                                               /**< (EMAC_NCFGR) Full Duplex Position */
#define EMAC_NCFGR_FD_Msk                     (_U_(0x1) << EMAC_NCFGR_FD_Pos)                      /**< (EMAC_NCFGR) Full Duplex Mask */
#define EMAC_NCFGR_FD(value)                  (EMAC_NCFGR_FD_Msk & ((value) << EMAC_NCFGR_FD_Pos))
#define EMAC_NCFGR_JFRAME_Pos                 _U_(3)                                               /**< (EMAC_NCFGR) Jumbo Frames Position */
#define EMAC_NCFGR_JFRAME_Msk                 (_U_(0x1) << EMAC_NCFGR_JFRAME_Pos)                  /**< (EMAC_NCFGR) Jumbo Frames Mask */
#define EMAC_NCFGR_JFRAME(value)              (EMAC_NCFGR_JFRAME_Msk & ((value) << EMAC_NCFGR_JFRAME_Pos))
#define EMAC_NCFGR_CAF_Pos                    _U_(4)                                               /**< (EMAC_NCFGR) Copy All Frames Position */
#define EMAC_NCFGR_CAF_Msk                    (_U_(0x1) << EMAC_NCFGR_CAF_Pos)                     /**< (EMAC_NCFGR) Copy All Frames Mask */
#define EMAC_NCFGR_CAF(value)                 (EMAC_NCFGR_CAF_Msk & ((value) << EMAC_NCFGR_CAF_Pos))
#define EMAC_NCFGR_NBC_Pos                    _U_(5)                                               /**< (EMAC_NCFGR) No Broadcast Position */
#define EMAC_NCFGR_NBC_Msk                    (_U_(0x1) << EMAC_NCFGR_NBC_Pos)                     /**< (EMAC_NCFGR) No Broadcast Mask */
#define EMAC_NCFGR_NBC(value)                 (EMAC_NCFGR_NBC_Msk & ((value) << EMAC_NCFGR_NBC_Pos))
#define EMAC_NCFGR_MTI_Pos                    _U_(6)                                               /**< (EMAC_NCFGR) Multicast Hash Enable Position */
#define EMAC_NCFGR_MTI_Msk                    (_U_(0x1) << EMAC_NCFGR_MTI_Pos)                     /**< (EMAC_NCFGR) Multicast Hash Enable Mask */
#define EMAC_NCFGR_MTI(value)                 (EMAC_NCFGR_MTI_Msk & ((value) << EMAC_NCFGR_MTI_Pos))
#define EMAC_NCFGR_UNI_Pos                    _U_(7)                                               /**< (EMAC_NCFGR) Unicast Hash Enable Position */
#define EMAC_NCFGR_UNI_Msk                    (_U_(0x1) << EMAC_NCFGR_UNI_Pos)                     /**< (EMAC_NCFGR) Unicast Hash Enable Mask */
#define EMAC_NCFGR_UNI(value)                 (EMAC_NCFGR_UNI_Msk & ((value) << EMAC_NCFGR_UNI_Pos))
#define EMAC_NCFGR_BIG_Pos                    _U_(8)                                               /**< (EMAC_NCFGR) Receive 1536 Bytes Frames Position */
#define EMAC_NCFGR_BIG_Msk                    (_U_(0x1) << EMAC_NCFGR_BIG_Pos)                     /**< (EMAC_NCFGR) Receive 1536 Bytes Frames Mask */
#define EMAC_NCFGR_BIG(value)                 (EMAC_NCFGR_BIG_Msk & ((value) << EMAC_NCFGR_BIG_Pos))
#define EMAC_NCFGR_EAE_Pos                    _U_(9)                                               /**< (EMAC_NCFGR) External Address Match Enable Position */
#define EMAC_NCFGR_EAE_Msk                    (_U_(0x1) << EMAC_NCFGR_EAE_Pos)                     /**< (EMAC_NCFGR) External Address Match Enable Mask */
#define EMAC_NCFGR_EAE(value)                 (EMAC_NCFGR_EAE_Msk & ((value) << EMAC_NCFGR_EAE_Pos))
#define EMAC_NCFGR_CLK_Pos                    _U_(10)                                              /**< (EMAC_NCFGR) MDC Clock Divider Position */
#define EMAC_NCFGR_CLK_Msk                    (_U_(0x3) << EMAC_NCFGR_CLK_Pos)                     /**< (EMAC_NCFGR) MDC Clock Divider Mask */
#define EMAC_NCFGR_CLK(value)                 (EMAC_NCFGR_CLK_Msk & ((value) << EMAC_NCFGR_CLK_Pos))
#define   EMAC_NCFGR_CLK_MCK_8_Val            _U_(0x0)                                             /**< (EMAC_NCFGR) MCK divided by 8 (MCK up to 20 MHz)  */
#define   EMAC_NCFGR_CLK_MCK_16_Val           _U_(0x1)                                             /**< (EMAC_NCFGR) MCK divided by 16 (MCK up to 40 MHz)  */
#define   EMAC_NCFGR_CLK_MCK_32_Val           _U_(0x2)                                             /**< (EMAC_NCFGR) MCK divided by 32 (MCK up to 80 MHz)  */
#define   EMAC_NCFGR_CLK_MCK_64_Val           _U_(0x3)                                             /**< (EMAC_NCFGR) MCK divided by 64 (MCK up to 160 MHz)  */
#define EMAC_NCFGR_CLK_MCK_8                  (EMAC_NCFGR_CLK_MCK_8_Val << EMAC_NCFGR_CLK_Pos)     /**< (EMAC_NCFGR) MCK divided by 8 (MCK up to 20 MHz) Position  */
#define EMAC_NCFGR_CLK_MCK_16                 (EMAC_NCFGR_CLK_MCK_16_Val << EMAC_NCFGR_CLK_Pos)    /**< (EMAC_NCFGR) MCK divided by 16 (MCK up to 40 MHz) Position  */
#define EMAC_NCFGR_CLK_MCK_32                 (EMAC_NCFGR_CLK_MCK_32_Val << EMAC_NCFGR_CLK_Pos)    /**< (EMAC_NCFGR) MCK divided by 32 (MCK up to 80 MHz) Position  */
#define EMAC_NCFGR_CLK_MCK_64                 (EMAC_NCFGR_CLK_MCK_64_Val << EMAC_NCFGR_CLK_Pos)    /**< (EMAC_NCFGR) MCK divided by 64 (MCK up to 160 MHz) Position  */
#define EMAC_NCFGR_RTY_Pos                    _U_(12)                                              /**< (EMAC_NCFGR) Retry Test Position */
#define EMAC_NCFGR_RTY_Msk                    (_U_(0x1) << EMAC_NCFGR_RTY_Pos)                     /**< (EMAC_NCFGR) Retry Test Mask */
#define EMAC_NCFGR_RTY(value)                 (EMAC_NCFGR_RTY_Msk & ((value) << EMAC_NCFGR_RTY_Pos))
#define EMAC_NCFGR_PAE_Pos                    _U_(13)                                              /**< (EMAC_NCFGR) Pause Enable Position */
#define EMAC_NCFGR_PAE_Msk                    (_U_(0x1) << EMAC_NCFGR_PAE_Pos)                     /**< (EMAC_NCFGR) Pause Enable Mask */
#define EMAC_NCFGR_PAE(value)                 (EMAC_NCFGR_PAE_Msk & ((value) << EMAC_NCFGR_PAE_Pos))
#define EMAC_NCFGR_RBOF_Pos                   _U_(14)                                              /**< (EMAC_NCFGR) Receive Buffer Offset Position */
#define EMAC_NCFGR_RBOF_Msk                   (_U_(0x3) << EMAC_NCFGR_RBOF_Pos)                    /**< (EMAC_NCFGR) Receive Buffer Offset Mask */
#define EMAC_NCFGR_RBOF(value)                (EMAC_NCFGR_RBOF_Msk & ((value) << EMAC_NCFGR_RBOF_Pos))
#define   EMAC_NCFGR_RBOF_OFFSET_0_Val        _U_(0x0)                                             /**< (EMAC_NCFGR) No offset from start of receive buffer  */
#define   EMAC_NCFGR_RBOF_OFFSET_1_Val        _U_(0x1)                                             /**< (EMAC_NCFGR) One-byte offset from start of receive buffer  */
#define   EMAC_NCFGR_RBOF_OFFSET_2_Val        _U_(0x2)                                             /**< (EMAC_NCFGR) Two-byte offset from start of receive buffer  */
#define   EMAC_NCFGR_RBOF_OFFSET_3_Val        _U_(0x3)                                             /**< (EMAC_NCFGR) Three-byte offset from start of receive buffer  */
#define EMAC_NCFGR_RBOF_OFFSET_0              (EMAC_NCFGR_RBOF_OFFSET_0_Val << EMAC_NCFGR_RBOF_Pos) /**< (EMAC_NCFGR) No offset from start of receive buffer Position  */
#define EMAC_NCFGR_RBOF_OFFSET_1              (EMAC_NCFGR_RBOF_OFFSET_1_Val << EMAC_NCFGR_RBOF_Pos) /**< (EMAC_NCFGR) One-byte offset from start of receive buffer Position  */
#define EMAC_NCFGR_RBOF_OFFSET_2              (EMAC_NCFGR_RBOF_OFFSET_2_Val << EMAC_NCFGR_RBOF_Pos) /**< (EMAC_NCFGR) Two-byte offset from start of receive buffer Position  */
#define EMAC_NCFGR_RBOF_OFFSET_3              (EMAC_NCFGR_RBOF_OFFSET_3_Val << EMAC_NCFGR_RBOF_Pos) /**< (EMAC_NCFGR) Three-byte offset from start of receive buffer Position  */
#define EMAC_NCFGR_RLCE_Pos                   _U_(16)                                              /**< (EMAC_NCFGR) Receive Length Field Checking Enable Position */
#define EMAC_NCFGR_RLCE_Msk                   (_U_(0x1) << EMAC_NCFGR_RLCE_Pos)                    /**< (EMAC_NCFGR) Receive Length Field Checking Enable Mask */
#define EMAC_NCFGR_RLCE(value)                (EMAC_NCFGR_RLCE_Msk & ((value) << EMAC_NCFGR_RLCE_Pos))
#define EMAC_NCFGR_DRFCS_Pos                  _U_(17)                                              /**< (EMAC_NCFGR) Discard Receive FCS Position */
#define EMAC_NCFGR_DRFCS_Msk                  (_U_(0x1) << EMAC_NCFGR_DRFCS_Pos)                   /**< (EMAC_NCFGR) Discard Receive FCS Mask */
#define EMAC_NCFGR_DRFCS(value)               (EMAC_NCFGR_DRFCS_Msk & ((value) << EMAC_NCFGR_DRFCS_Pos))
#define EMAC_NCFGR_EFRHD_Pos                  _U_(18)                                              /**< (EMAC_NCFGR) Enable Frames Received in Half Duplex Position */
#define EMAC_NCFGR_EFRHD_Msk                  (_U_(0x1) << EMAC_NCFGR_EFRHD_Pos)                   /**< (EMAC_NCFGR) Enable Frames Received in Half Duplex Mask */
#define EMAC_NCFGR_EFRHD(value)               (EMAC_NCFGR_EFRHD_Msk & ((value) << EMAC_NCFGR_EFRHD_Pos))
#define EMAC_NCFGR_IRXFCS_Pos                 _U_(19)                                              /**< (EMAC_NCFGR) Ignore RX FCS Position */
#define EMAC_NCFGR_IRXFCS_Msk                 (_U_(0x1) << EMAC_NCFGR_IRXFCS_Pos)                  /**< (EMAC_NCFGR) Ignore RX FCS Mask */
#define EMAC_NCFGR_IRXFCS(value)              (EMAC_NCFGR_IRXFCS_Msk & ((value) << EMAC_NCFGR_IRXFCS_Pos))
#define EMAC_NCFGR_Msk                        _U_(0x000FFFFB)                                      /**< (EMAC_NCFGR) Register Mask  */


/* -------- EMAC_NSR : (EMAC Offset: 0x08) ( R/ 32) Network Status Register -------- */
#define EMAC_NSR_LINKR_Pos                    _U_(0)                                               /**< (EMAC_NSR) Link Pin Status Position */
#define EMAC_NSR_LINKR_Msk                    (_U_(0x1) << EMAC_NSR_LINKR_Pos)                     /**< (EMAC_NSR) Link Pin Status Mask */
#define EMAC_NSR_LINKR(value)                 (EMAC_NSR_LINKR_Msk & ((value) << EMAC_NSR_LINKR_Pos))
#define EMAC_NSR_MDIO_Pos                     _U_(1)                                               /**< (EMAC_NSR) MDIO Input Status Position */
#define EMAC_NSR_MDIO_Msk                     (_U_(0x1) << EMAC_NSR_MDIO_Pos)                      /**< (EMAC_NSR) MDIO Input Status Mask */
#define EMAC_NSR_MDIO(value)                  (EMAC_NSR_MDIO_Msk & ((value) << EMAC_NSR_MDIO_Pos))
#define EMAC_NSR_IDLE_Pos                     _U_(2)                                               /**< (EMAC_NSR) PHY Management Logic Status Position */
#define EMAC_NSR_IDLE_Msk                     (_U_(0x1) << EMAC_NSR_IDLE_Pos)                      /**< (EMAC_NSR) PHY Management Logic Status Mask */
#define EMAC_NSR_IDLE(value)                  (EMAC_NSR_IDLE_Msk & ((value) << EMAC_NSR_IDLE_Pos))
#define EMAC_NSR_Msk                          _U_(0x00000007)                                      /**< (EMAC_NSR) Register Mask  */


/* -------- EMAC_TSR : (EMAC Offset: 0x14) (R/W 32) Transmit Status Register -------- */
#define EMAC_TSR_UBR_Pos                      _U_(0)                                               /**< (EMAC_TSR) Used Bit Read (cleared by writing a one to this bit) Position */
#define EMAC_TSR_UBR_Msk                      (_U_(0x1) << EMAC_TSR_UBR_Pos)                       /**< (EMAC_TSR) Used Bit Read (cleared by writing a one to this bit) Mask */
#define EMAC_TSR_UBR(value)                   (EMAC_TSR_UBR_Msk & ((value) << EMAC_TSR_UBR_Pos))  
#define EMAC_TSR_COL_Pos                      _U_(1)                                               /**< (EMAC_TSR) Collision Occurred (cleared by writing a one to this bit) Position */
#define EMAC_TSR_COL_Msk                      (_U_(0x1) << EMAC_TSR_COL_Pos)                       /**< (EMAC_TSR) Collision Occurred (cleared by writing a one to this bit) Mask */
#define EMAC_TSR_COL(value)                   (EMAC_TSR_COL_Msk & ((value) << EMAC_TSR_COL_Pos))  
#define EMAC_TSR_RLES_Pos                     _U_(2)                                               /**< (EMAC_TSR) Retry Limit Exceeded (cleared by writing a one to this bit) Position */
#define EMAC_TSR_RLES_Msk                     (_U_(0x1) << EMAC_TSR_RLES_Pos)                      /**< (EMAC_TSR) Retry Limit Exceeded (cleared by writing a one to this bit) Mask */
#define EMAC_TSR_RLES(value)                  (EMAC_TSR_RLES_Msk & ((value) << EMAC_TSR_RLES_Pos))
#define EMAC_TSR_TGO_Pos                      _U_(3)                                               /**< (EMAC_TSR) Transmit Go Position */
#define EMAC_TSR_TGO_Msk                      (_U_(0x1) << EMAC_TSR_TGO_Pos)                       /**< (EMAC_TSR) Transmit Go Mask */
#define EMAC_TSR_TGO(value)                   (EMAC_TSR_TGO_Msk & ((value) << EMAC_TSR_TGO_Pos))  
#define EMAC_TSR_BEX_Pos                      _U_(4)                                               /**< (EMAC_TSR) Buffers Exhausted Mid-frame (cleared by writing a one to this bit) Position */
#define EMAC_TSR_BEX_Msk                      (_U_(0x1) << EMAC_TSR_BEX_Pos)                       /**< (EMAC_TSR) Buffers Exhausted Mid-frame (cleared by writing a one to this bit) Mask */
#define EMAC_TSR_BEX(value)                   (EMAC_TSR_BEX_Msk & ((value) << EMAC_TSR_BEX_Pos))  
#define EMAC_TSR_COMP_Pos                     _U_(5)                                               /**< (EMAC_TSR) Transmit Complete (cleared by writing a one to this bit) Position */
#define EMAC_TSR_COMP_Msk                     (_U_(0x1) << EMAC_TSR_COMP_Pos)                      /**< (EMAC_TSR) Transmit Complete (cleared by writing a one to this bit) Mask */
#define EMAC_TSR_COMP(value)                  (EMAC_TSR_COMP_Msk & ((value) << EMAC_TSR_COMP_Pos))
#define EMAC_TSR_UND_Pos                      _U_(6)                                               /**< (EMAC_TSR) Transmit Underrun (cleared by writing a one to this bit) Position */
#define EMAC_TSR_UND_Msk                      (_U_(0x1) << EMAC_TSR_UND_Pos)                       /**< (EMAC_TSR) Transmit Underrun (cleared by writing a one to this bit) Mask */
#define EMAC_TSR_UND(value)                   (EMAC_TSR_UND_Msk & ((value) << EMAC_TSR_UND_Pos))  
#define EMAC_TSR_Msk                          _U_(0x0000007F)                                      /**< (EMAC_TSR) Register Mask  */


/* -------- EMAC_RBQP : (EMAC Offset: 0x18) (R/W 32) Receive Buffer Queue Pointer Register -------- */
#define EMAC_RBQP_ADDR_Pos                    _U_(2)                                               /**< (EMAC_RBQP) Receive Buffer Queue Pointer Address Position */
#define EMAC_RBQP_ADDR_Msk                    (_U_(0x3FFFFFFF) << EMAC_RBQP_ADDR_Pos)              /**< (EMAC_RBQP) Receive Buffer Queue Pointer Address Mask */
#define EMAC_RBQP_ADDR(value)                 (EMAC_RBQP_ADDR_Msk & ((value) << EMAC_RBQP_ADDR_Pos))
#define EMAC_RBQP_Msk                         _U_(0xFFFFFFFC)                                      /**< (EMAC_RBQP) Register Mask  */


/* -------- EMAC_TBQP : (EMAC Offset: 0x1C) (R/W 32) Transmit Buffer Queue Pointer Register -------- */
#define EMAC_TBQP_ADDR_Pos                    _U_(2)                                               /**< (EMAC_TBQP) Transmit Buffer Queue Pointer Address Position */
#define EMAC_TBQP_ADDR_Msk                    (_U_(0x3FFFFFFF) << EMAC_TBQP_ADDR_Pos)              /**< (EMAC_TBQP) Transmit Buffer Queue Pointer Address Mask */
#define EMAC_TBQP_ADDR(value)                 (EMAC_TBQP_ADDR_Msk & ((value) << EMAC_TBQP_ADDR_Pos))
#define EMAC_TBQP_Msk                         _U_(0xFFFFFFFC)                                      /**< (EMAC_TBQP) Register Mask  */


/* -------- EMAC_RSR : (EMAC Offset: 0x20) (R/W 32) Receive Status Register -------- */
#define EMAC_RSR_BNA_Pos                      _U_(0)                                               /**< (EMAC_RSR) Buffer Not Available (cleared by writing a one to this bit) Position */
#define EMAC_RSR_BNA_Msk                      (_U_(0x1) << EMAC_RSR_BNA_Pos)                       /**< (EMAC_RSR) Buffer Not Available (cleared by writing a one to this bit) Mask */
#define EMAC_RSR_BNA(value)                   (EMAC_RSR_BNA_Msk & ((value) << EMAC_RSR_BNA_Pos))  
#define EMAC_RSR_REC_Pos                      _U_(1)                                               /**< (EMAC_RSR) Frame Received (cleared by writing a one to this bit) Position */
#define EMAC_RSR_REC_Msk                      (_U_(0x1) << EMAC_RSR_REC_Pos)                       /**< (EMAC_RSR) Frame Received (cleared by writing a one to this bit) Mask */
#define EMAC_RSR_REC(value)                   (EMAC_RSR_REC_Msk & ((value) << EMAC_RSR_REC_Pos))  
#define EMAC_RSR_OVR_Pos                      _U_(2)                                               /**< (EMAC_RSR) Receive Overrun (cleared by writing a one to this bit) Position */
#define EMAC_RSR_OVR_Msk                      (_U_(0x1) << EMAC_RSR_OVR_Pos)                       /**< (EMAC_RSR) Receive Overrun (cleared by writing a one to this bit) Mask */
#define EMAC_RSR_OVR(value)                   (EMAC_RSR_OVR_Msk & ((value) << EMAC_RSR_OVR_Pos))  
#define EMAC_RSR_Msk                          _U_(0x00000007)                                      /**< (EMAC_RSR) Register Mask  */


