Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/emac.h
/* -------- EMAC_ISR : (EMAC Offset: 0x24) (R/W 32) Interrupt Status Register -------- */
#define EMAC_ISR_MFD_Pos                      _U_(0)                                               /**< (EMAC_ISR) Management Frame Done (cleared on read) Position */
#define EMAC_ISR_MFD_Msk                      (_U_(0x1) << EMAC_ISR_MFD_Pos)                       /**< (EMAC_ISR) Management Frame Done (cleared on read) Mask */
#define EMAC_ISR_MFD(value)                   (EMAC_ISR_MFD_Msk & ((value) << EMAC_ISR_MFD_Pos))  
#define EMAC_ISR_RCOMP_Pos                    _U_(1)                                               /**< (EMAC_ISR) Receive Complete (cleared on read) Position */
#define EMAC_ISR_RCOMP_Msk                    (_U_(0x1) << EMAC_ISR_RCOMP_Pos)                     /**< (EMAC_ISR) Receive Complete (cleared on read) Mask */
#define EMAC_ISR_RCOMP(value)                 (EMAC_ISR_RCOMP_Msk & ((value) << EMAC_ISR_RCOMP_Pos))
#define EMAC_ISR_RXUBR_Pos                    _U_(2)                                               /**< (EMAC_ISR) Receive Used Bit Read (cleared on read) Position */
#define EMAC_ISR_RXUBR_Msk                    (_U_(0x1) << EMAC_ISR_RXUBR_Pos)                     /**< (EMAC_ISR) Receive Used Bit Read (cleared on read) Mask */
#define EMAC_ISR_RXUBR(value)                 (EMAC_ISR_RXUBR_Msk & ((value) << EMAC_ISR_RXUBR_Pos))
#define EMAC_ISR_TXUBR_Pos                    _U_(3)                                               /**< (EMAC_ISR) Transmit Used Bit Read (cleared on read) Position */
#define EMAC_ISR_TXUBR_Msk                    (_U_(0x1) << EMAC_ISR_TXUBR_Pos)                     /**< (EMAC_ISR) Transmit Used Bit Read (cleared on read) Mask */
#define EMAC_ISR_TXUBR(value)                 (EMAC_ISR_TXUBR_Msk & ((value) << EMAC_ISR_TXUBR_Pos))
#define EMAC_ISR_TUND_Pos                     _U_(4)                                               /**< (EMAC_ISR) Ethernet Transmit Buffer Underrun (cleared on read) Position */
#define EMAC_ISR_TUND_Msk                     (_U_(0x1) << EMAC_ISR_TUND_Pos)                      /**< (EMAC_ISR) Ethernet Transmit Buffer Underrun (cleared on read) Mask */
#define EMAC_ISR_TUND(value)                  (EMAC_ISR_TUND_Msk & ((value) << EMAC_ISR_TUND_Pos))
#define EMAC_ISR_RLEX_Pos                     _U_(5)                                               /**< (EMAC_ISR) Retry Limit Exceeded (cleared on read) Position */
#define EMAC_ISR_RLEX_Msk                     (_U_(0x1) << EMAC_ISR_RLEX_Pos)                      /**< (EMAC_ISR) Retry Limit Exceeded (cleared on read) Mask */
#define EMAC_ISR_RLEX(value)                  (EMAC_ISR_RLEX_Msk & ((value) << EMAC_ISR_RLEX_Pos))
#define EMAC_ISR_TXERR_Pos                    _U_(6)                                               /**< (EMAC_ISR) Transmit Error (cleared on read) Position */
#define EMAC_ISR_TXERR_Msk                    (_U_(0x1) << EMAC_ISR_TXERR_Pos)                     /**< (EMAC_ISR) Transmit Error (cleared on read) Mask */
#define EMAC_ISR_TXERR(value)                 (EMAC_ISR_TXERR_Msk & ((value) << EMAC_ISR_TXERR_Pos))
#define EMAC_ISR_TCOMP_Pos                    _U_(7)                                               /**< (EMAC_ISR) Transmit Complete (cleared on read) Position */
#define EMAC_ISR_TCOMP_Msk                    (_U_(0x1) << EMAC_ISR_TCOMP_Pos)                     /**< (EMAC_ISR) Transmit Complete (cleared on read) Mask */
#define EMAC_ISR_TCOMP(value)                 (EMAC_ISR_TCOMP_Msk & ((value) << EMAC_ISR_TCOMP_Pos))
#define EMAC_ISR_LINK_Pos                     _U_(9)                                               /**< (EMAC_ISR) Link Change (cleared on read) Position */
#define EMAC_ISR_LINK_Msk                     (_U_(0x1) << EMAC_ISR_LINK_Pos)                      /**< (EMAC_ISR) Link Change (cleared on read) Mask */
#define EMAC_ISR_LINK(value)                  (EMAC_ISR_LINK_Msk & ((value) << EMAC_ISR_LINK_Pos))
#define EMAC_ISR_ROVR_Pos                     _U_(10)                                              /**< (EMAC_ISR) Receive Overrun (cleared on read) Position */
#define EMAC_ISR_ROVR_Msk                     (_U_(0x1) << EMAC_ISR_ROVR_Pos)                      /**< (EMAC_ISR) Receive Overrun (cleared on read) Mask */
#define EMAC_ISR_ROVR(value)                  (EMAC_ISR_ROVR_Msk & ((value) << EMAC_ISR_ROVR_Pos))
#define EMAC_ISR_HRESP_Pos                    _U_(11)                                              /**< (EMAC_ISR) Hresp Not OK (cleared on read) Position */
#define EMAC_ISR_HRESP_Msk                    (_U_(0x1) << EMAC_ISR_HRESP_Pos)                     /**< (EMAC_ISR) Hresp Not OK (cleared on read) Mask */
#define EMAC_ISR_HRESP(value)                 (EMAC_ISR_HRESP_Msk & ((value) << EMAC_ISR_HRESP_Pos))
#define EMAC_ISR_PFRE_Pos                     _U_(12)                                              /**< (EMAC_ISR) Pause Frame Received (cleared on read) Position */
#define EMAC_ISR_PFRE_Msk                     (_U_(0x1) << EMAC_ISR_PFRE_Pos)                      /**< (EMAC_ISR) Pause Frame Received (cleared on read) Mask */
#define EMAC_ISR_PFRE(value)                  (EMAC_ISR_PFRE_Msk & ((value) << EMAC_ISR_PFRE_Pos))
#define EMAC_ISR_PTZ_Pos                      _U_(13)                                              /**< (EMAC_ISR) Pause Time Zero (cleared on read) Position */
#define EMAC_ISR_PTZ_Msk                      (_U_(0x1) << EMAC_ISR_PTZ_Pos)                       /**< (EMAC_ISR) Pause Time Zero (cleared on read) Mask */
#define EMAC_ISR_PTZ(value)                   (EMAC_ISR_PTZ_Msk & ((value) << EMAC_ISR_PTZ_Pos))  
#define EMAC_ISR_WOL_Pos                      _U_(14)                                              /**< (EMAC_ISR) Wake-On-LAN (cleared on read) Position */
#define EMAC_ISR_WOL_Msk                      (_U_(0x1) << EMAC_ISR_WOL_Pos)                       /**< (EMAC_ISR) Wake-On-LAN (cleared on read) Mask */
#define EMAC_ISR_WOL(value)                   (EMAC_ISR_WOL_Msk & ((value) << EMAC_ISR_WOL_Pos))  
#define EMAC_ISR_Msk                          _U_(0x00007EFF)                                      /**< (EMAC_ISR) Register Mask  */


