Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/emac.h
/* -------- EMAC_IER : (EMAC Offset: 0x28) ( /W 32) Interrupt Enable Register -------- */
#define EMAC_IER_MFD_Pos                      _U_(0)                                               /**< (EMAC_IER) Management Frame Done Position */
#define EMAC_IER_MFD_Msk                      (_U_(0x1) << EMAC_IER_MFD_Pos)                       /**< (EMAC_IER) Management Frame Done Mask */
#define EMAC_IER_MFD(value)                   (EMAC_IER_MFD_Msk & ((value) << EMAC_IER_MFD_Pos))  
#define EMAC_IER_RCOMP_Pos                    _U_(1)                                               /**< (EMAC_IER) Receive Complete Position */
#define EMAC_IER_RCOMP_Msk                    (_U_(0x1) << EMAC_IER_RCOMP_Pos)                     /**< (EMAC_IER) Receive Complete Mask */
#define EMAC_IER_RCOMP(value)                 (EMAC_IER_RCOMP_Msk & ((value) << EMAC_IER_RCOMP_Pos))
#define EMAC_IER_RXUBR_Pos                    _U_(2)                                               /**< (EMAC_IER) Receive Used Bit Read Position */
#define EMAC_IER_RXUBR_Msk                    (_U_(0x1) << EMAC_IER_RXUBR_Pos)                     /**< (EMAC_IER) Receive Used Bit Read Mask */
#define EMAC_IER_RXUBR(value)                 (EMAC_IER_RXUBR_Msk & ((value) << EMAC_IER_RXUBR_Pos))
#define EMAC_IER_TXUBR_Pos                    _U_(3)                                               /**< (EMAC_IER) Transmit Used Bit Read Position */
#define EMAC_IER_TXUBR_Msk                    (_U_(0x1) << EMAC_IER_TXUBR_Pos)                     /**< (EMAC_IER) Transmit Used Bit Read Mask */
#define EMAC_IER_TXUBR(value)                 (EMAC_IER_TXUBR_Msk & ((value) << EMAC_IER_TXUBR_Pos))
#define EMAC_IER_TUND_Pos                     _U_(4)                                               /**< (EMAC_IER) Ethernet Transmit Buffer Underrun Position */
#define EMAC_IER_TUND_Msk                     (_U_(0x1) << EMAC_IER_TUND_Pos)                      /**< (EMAC_IER) Ethernet Transmit Buffer Underrun Mask */
#define EMAC_IER_TUND(value)                  (EMAC_IER_TUND_Msk & ((value) << EMAC_IER_TUND_Pos))
#define EMAC_IER_RLE_Pos                      _U_(5)                                               /**< (EMAC_IER) Retry Limit Exceeded Position */
#define EMAC_IER_RLE_Msk                      (_U_(0x1) << EMAC_IER_RLE_Pos)                       /**< (EMAC_IER) Retry Limit Exceeded Mask */
#define EMAC_IER_RLE(value)                   (EMAC_IER_RLE_Msk & ((value) << EMAC_IER_RLE_Pos))  
#define EMAC_IER_TXERR_Pos                    _U_(6)                                               /**< (EMAC_IER) Transmit Error Position */
#define EMAC_IER_TXERR_Msk                    (_U_(0x1) << EMAC_IER_TXERR_Pos)                     /**< (EMAC_IER) Transmit Error Mask */
#define EMAC_IER_TXERR(value)                 (EMAC_IER_TXERR_Msk & ((value) << EMAC_IER_TXERR_Pos))
#define EMAC_IER_TCOMP_Pos                    _U_(7)                                               /**< (EMAC_IER) Transmit Complete Position */
#define EMAC_IER_TCOMP_Msk                    (_U_(0x1) << EMAC_IER_TCOMP_Pos)                     /**< (EMAC_IER) Transmit Complete Mask */
#define EMAC_IER_TCOMP(value)                 (EMAC_IER_TCOMP_Msk & ((value) << EMAC_IER_TCOMP_Pos))
#define EMAC_IER_LINK_Pos                     _U_(9)                                               /**< (EMAC_IER) Link Change Position */
#define EMAC_IER_LINK_Msk                     (_U_(0x1) << EMAC_IER_LINK_Pos)                      /**< (EMAC_IER) Link Change Mask */
#define EMAC_IER_LINK(value)                  (EMAC_IER_LINK_Msk & ((value) << EMAC_IER_LINK_Pos))
#define EMAC_IER_ROVR_Pos                     _U_(10)                                              /**< (EMAC_IER) Receive Overrun Position */
#define EMAC_IER_ROVR_Msk                     (_U_(0x1) << EMAC_IER_ROVR_Pos)                      /**< (EMAC_IER) Receive Overrun Mask */
#define EMAC_IER_ROVR(value)                  (EMAC_IER_ROVR_Msk & ((value) << EMAC_IER_ROVR_Pos))
#define EMAC_IER_HRESP_Pos                    _U_(11)                                              /**< (EMAC_IER) Hresp Not OK Position */
#define EMAC_IER_HRESP_Msk                    (_U_(0x1) << EMAC_IER_HRESP_Pos)                     /**< (EMAC_IER) Hresp Not OK Mask */
#define EMAC_IER_HRESP(value)                 (EMAC_IER_HRESP_Msk & ((value) << EMAC_IER_HRESP_Pos))
#define EMAC_IER_PFR_Pos                      _U_(12)                                              /**< (EMAC_IER) Pause Frame Received Position */
#define EMAC_IER_PFR_Msk                      (_U_(0x1) << EMAC_IER_PFR_Pos)                       /**< (EMAC_IER) Pause Frame Received Mask */
#define EMAC_IER_PFR(value)                   (EMAC_IER_PFR_Msk & ((value) << EMAC_IER_PFR_Pos))  
#define EMAC_IER_PTZ_Pos                      _U_(13)                                              /**< (EMAC_IER) Pause Time Zero Position */
#define EMAC_IER_PTZ_Msk                      (_U_(0x1) << EMAC_IER_PTZ_Pos)                       /**< (EMAC_IER) Pause Time Zero Mask */
#define EMAC_IER_PTZ(value)                   (EMAC_IER_PTZ_Msk & ((value) << EMAC_IER_PTZ_Pos))  
#define EMAC_IER_WOL_Pos                      _U_(14)                                              /**< (EMAC_IER) Wake-On-LAN Position */
#define EMAC_IER_WOL_Msk                      (_U_(0x1) << EMAC_IER_WOL_Pos)                       /**< (EMAC_IER) Wake-On-LAN Mask */
#define EMAC_IER_WOL(value)                   (EMAC_IER_WOL_Msk & ((value) << EMAC_IER_WOL_Pos))  
#define EMAC_IER_Msk                          _U_(0x00007EFF)                                      /**< (EMAC_IER) Register Mask  */


/* -------- EMAC_IDR : (EMAC Offset: 0x2C) ( /W 32) Interrupt Disable Register -------- */
#define EMAC_IDR_MFD_Pos                      _U_(0)                                               /**< (EMAC_IDR) Management Frame Done Position */
#define EMAC_IDR_MFD_Msk                      (_U_(0x1) << EMAC_IDR_MFD_Pos)                       /**< (EMAC_IDR) Management Frame Done Mask */
#define EMAC_IDR_MFD(value)                   (EMAC_IDR_MFD_Msk & ((value) << EMAC_IDR_MFD_Pos))  
#define EMAC_IDR_RCOMP_Pos                    _U_(1)                                               /**< (EMAC_IDR) Receive Complete Position */
#define EMAC_IDR_RCOMP_Msk                    (_U_(0x1) << EMAC_IDR_RCOMP_Pos)                     /**< (EMAC_IDR) Receive Complete Mask */
#define EMAC_IDR_RCOMP(value)                 (EMAC_IDR_RCOMP_Msk & ((value) << EMAC_IDR_RCOMP_Pos))
#define EMAC_IDR_RXUBR_Pos                    _U_(2)                                               /**< (EMAC_IDR) Receive Used Bit Read Position */
#define EMAC_IDR_RXUBR_Msk                    (_U_(0x1) << EMAC_IDR_RXUBR_Pos)                     /**< (EMAC_IDR) Receive Used Bit Read Mask */
#define EMAC_IDR_RXUBR(value)                 (EMAC_IDR_RXUBR_Msk & ((value) << EMAC_IDR_RXUBR_Pos))
#define EMAC_IDR_TXUBR_Pos                    _U_(3)                                               /**< (EMAC_IDR) Transmit Used Bit Read Position */
#define EMAC_IDR_TXUBR_Msk                    (_U_(0x1) << EMAC_IDR_TXUBR_Pos)                     /**< (EMAC_IDR) Transmit Used Bit Read Mask */
#define EMAC_IDR_TXUBR(value)                 (EMAC_IDR_TXUBR_Msk & ((value) << EMAC_IDR_TXUBR_Pos))
#define EMAC_IDR_TUND_Pos                     _U_(4)                                               /**< (EMAC_IDR) Ethernet Transmit Buffer Underrun Position */
#define EMAC_IDR_TUND_Msk                     (_U_(0x1) << EMAC_IDR_TUND_Pos)                      /**< (EMAC_IDR) Ethernet Transmit Buffer Underrun Mask */
#define EMAC_IDR_TUND(value)                  (EMAC_IDR_TUND_Msk & ((value) << EMAC_IDR_TUND_Pos))
#define EMAC_IDR_RLE_Pos                      _U_(5)                                               /**< (EMAC_IDR) Retry Limit Exceeded Position */
#define EMAC_IDR_RLE_Msk                      (_U_(0x1) << EMAC_IDR_RLE_Pos)                       /**< (EMAC_IDR) Retry Limit Exceeded Mask */
#define EMAC_IDR_RLE(value)                   (EMAC_IDR_RLE_Msk & ((value) << EMAC_IDR_RLE_Pos))  
#define EMAC_IDR_TXERR_Pos                    _U_(6)                                               /**< (EMAC_IDR) Transmit Error Position */
#define EMAC_IDR_TXERR_Msk                    (_U_(0x1) << EMAC_IDR_TXERR_Pos)                     /**< (EMAC_IDR) Transmit Error Mask */
#define EMAC_IDR_TXERR(value)                 (EMAC_IDR_TXERR_Msk & ((value) << EMAC_IDR_TXERR_Pos))
#define EMAC_IDR_TCOMP_Pos                    _U_(7)                                               /**< (EMAC_IDR) Transmit Complete Position */
#define EMAC_IDR_TCOMP_Msk                    (_U_(0x1) << EMAC_IDR_TCOMP_Pos)                     /**< (EMAC_IDR) Transmit Complete Mask */
#define EMAC_IDR_TCOMP(value)                 (EMAC_IDR_TCOMP_Msk & ((value) << EMAC_IDR_TCOMP_Pos))
#define EMAC_IDR_LINK_Pos                     _U_(9)                                               /**< (EMAC_IDR) Link Change Position */
#define EMAC_IDR_LINK_Msk                     (_U_(0x1) << EMAC_IDR_LINK_Pos)                      /**< (EMAC_IDR) Link Change Mask */
#define EMAC_IDR_LINK(value)                  (EMAC_IDR_LINK_Msk & ((value) << EMAC_IDR_LINK_Pos))
#define EMAC_IDR_ROVR_Pos                     _U_(10)                                              /**< (EMAC_IDR) Receive Overrun Position */
#define EMAC_IDR_ROVR_Msk                     (_U_(0x1) << EMAC_IDR_ROVR_Pos)                      /**< (EMAC_IDR) Receive Overrun Mask */
#define EMAC_IDR_ROVR(value)                  (EMAC_IDR_ROVR_Msk & ((value) << EMAC_IDR_ROVR_Pos))
#define EMAC_IDR_HRESP_Pos                    _U_(11)                                              /**< (EMAC_IDR) Hresp Not OK Position */
#define EMAC_IDR_HRESP_Msk                    (_U_(0x1) << EMAC_IDR_HRESP_Pos)                     /**< (EMAC_IDR) Hresp Not OK Mask */
#define EMAC_IDR_HRESP(value)                 (EMAC_IDR_HRESP_Msk & ((value) << EMAC_IDR_HRESP_Pos))
#define EMAC_IDR_PFR_Pos                      _U_(12)                                              /**< (EMAC_IDR) Pause Frame Received Position */
#define EMAC_IDR_PFR_Msk                      (_U_(0x1) << EMAC_IDR_PFR_Pos)                       /**< (EMAC_IDR) Pause Frame Received Mask */
#define EMAC_IDR_PFR(value)                   (EMAC_IDR_PFR_Msk & ((value) << EMAC_IDR_PFR_Pos))  
#define EMAC_IDR_PTZ_Pos                      _U_(13)                                              /**< (EMAC_IDR) Pause Time Zero Position */
#define EMAC_IDR_PTZ_Msk                      (_U_(0x1) << EMAC_IDR_PTZ_Pos)                       /**< (EMAC_IDR) Pause Time Zero Mask */
#define EMAC_IDR_PTZ(value)                   (EMAC_IDR_PTZ_Msk & ((value) << EMAC_IDR_PTZ_Pos))  
#define EMAC_IDR_WOL_Pos                      _U_(14)                                              /**< (EMAC_IDR) Wake-On-LAN Position */
#define EMAC_IDR_WOL_Msk                      (_U_(0x1) << EMAC_IDR_WOL_Pos)                       /**< (EMAC_IDR) Wake-On-LAN Mask */
#define EMAC_IDR_WOL(value)                   (EMAC_IDR_WOL_Msk & ((value) << EMAC_IDR_WOL_Pos))  
#define EMAC_IDR_Msk                          _U_(0x00007EFF)                                      /**< (EMAC_IDR) Register Mask  */


/* -------- EMAC_IMR : (EMAC Offset: 0x30) ( R/ 32) Interrupt Mask Register -------- */
#define EMAC_IMR_MFD_Pos                      _U_(0)                                               /**< (EMAC_IMR) Management Frame Done Position */
#define EMAC_IMR_MFD_Msk                      (_U_(0x1) << EMAC_IMR_MFD_Pos)                       /**< (EMAC_IMR) Management Frame Done Mask */
#define EMAC_IMR_MFD(value)                   (EMAC_IMR_MFD_Msk & ((value) << EMAC_IMR_MFD_Pos))  
#define EMAC_IMR_RCOMP_Pos                    _U_(1)                                               /**< (EMAC_IMR) Receive Complete Position */
#define EMAC_IMR_RCOMP_Msk                    (_U_(0x1) << EMAC_IMR_RCOMP_Pos)                     /**< (EMAC_IMR) Receive Complete Mask */
#define EMAC_IMR_RCOMP(value)                 (EMAC_IMR_RCOMP_Msk & ((value) << EMAC_IMR_RCOMP_Pos))
#define EMAC_IMR_RXUBR_Pos                    _U_(2)                                               /**< (EMAC_IMR) Receive Used Bit Read Position */
#define EMAC_IMR_RXUBR_Msk                    (_U_(0x1) << EMAC_IMR_RXUBR_Pos)                     /**< (EMAC_IMR) Receive Used Bit Read Mask */
#define EMAC_IMR_RXUBR(value)                 (EMAC_IMR_RXUBR_Msk & ((value) << EMAC_IMR_RXUBR_Pos))
#define EMAC_IMR_TXUBR_Pos                    _U_(3)                                               /**< (EMAC_IMR) Transmit Used Bit Read Position */
#define EMAC_IMR_TXUBR_Msk                    (_U_(0x1) << EMAC_IMR_TXUBR_Pos)                     /**< (EMAC_IMR) Transmit Used Bit Read Mask */
#define EMAC_IMR_TXUBR(value)                 (EMAC_IMR_TXUBR_Msk & ((value) << EMAC_IMR_TXUBR_Pos))
#define EMAC_IMR_TUND_Pos                     _U_(4)                                               /**< (EMAC_IMR) Ethernet Transmit Buffer Underrun Position */
#define EMAC_IMR_TUND_Msk                     (_U_(0x1) << EMAC_IMR_TUND_Pos)                      /**< (EMAC_IMR) Ethernet Transmit Buffer Underrun Mask */
#define EMAC_IMR_TUND(value)                  (EMAC_IMR_TUND_Msk & ((value) << EMAC_IMR_TUND_Pos))
#define EMAC_IMR_RLE_Pos                      _U_(5)                                               /**< (EMAC_IMR) Retry Limit Exceeded Position */
#define EMAC_IMR_RLE_Msk                      (_U_(0x1) << EMAC_IMR_RLE_Pos)                       /**< (EMAC_IMR) Retry Limit Exceeded Mask */
#define EMAC_IMR_RLE(value)                   (EMAC_IMR_RLE_Msk & ((value) << EMAC_IMR_RLE_Pos))  
#define EMAC_IMR_TXERR_Pos                    _U_(6)                                               /**< (EMAC_IMR) Transmit Error Position */
#define EMAC_IMR_TXERR_Msk                    (_U_(0x1) << EMAC_IMR_TXERR_Pos)                     /**< (EMAC_IMR) Transmit Error Mask */
#define EMAC_IMR_TXERR(value)                 (EMAC_IMR_TXERR_Msk & ((value) << EMAC_IMR_TXERR_Pos))
#define EMAC_IMR_TCOMP_Pos                    _U_(7)                                               /**< (EMAC_IMR) Transmit Complete Position */
#define EMAC_IMR_TCOMP_Msk                    (_U_(0x1) << EMAC_IMR_TCOMP_Pos)                     /**< (EMAC_IMR) Transmit Complete Mask */
#define EMAC_IMR_TCOMP(value)                 (EMAC_IMR_TCOMP_Msk & ((value) << EMAC_IMR_TCOMP_Pos))
#define EMAC_IMR_LINK_Pos                     _U_(9)                                               /**< (EMAC_IMR) Link Change Position */
#define EMAC_IMR_LINK_Msk                     (_U_(0x1) << EMAC_IMR_LINK_Pos)                      /**< (EMAC_IMR) Link Change Mask */
#define EMAC_IMR_LINK(value)                  (EMAC_IMR_LINK_Msk & ((value) << EMAC_IMR_LINK_Pos))
#define EMAC_IMR_ROVR_Pos                     _U_(10)                                              /**< (EMAC_IMR) Receive Overrun Position */
#define EMAC_IMR_ROVR_Msk                     (_U_(0x1) << EMAC_IMR_ROVR_Pos)                      /**< (EMAC_IMR) Receive Overrun Mask */
#define EMAC_IMR_ROVR(value)                  (EMAC_IMR_ROVR_Msk & ((value) << EMAC_IMR_ROVR_Pos))
#define EMAC_IMR_HRESP_Pos                    _U_(11)                                              /**< (EMAC_IMR) Hresp Not OK Position */
#define EMAC_IMR_HRESP_Msk                    (_U_(0x1) << EMAC_IMR_HRESP_Pos)                     /**< (EMAC_IMR) Hresp Not OK Mask */
#define EMAC_IMR_HRESP(value)                 (EMAC_IMR_HRESP_Msk & ((value) << EMAC_IMR_HRESP_Pos))
#define EMAC_IMR_PFR_Pos                      _U_(12)                                              /**< (EMAC_IMR) Pause Frame Received Position */
#define EMAC_IMR_PFR_Msk                      (_U_(0x1) << EMAC_IMR_PFR_Pos)                       /**< (EMAC_IMR) Pause Frame Received Mask */
#define EMAC_IMR_PFR(value)                   (EMAC_IMR_PFR_Msk & ((value) << EMAC_IMR_PFR_Pos))  
#define EMAC_IMR_PTZ_Pos                      _U_(13)                                              /**< (EMAC_IMR) Pause Time Zero Position */
#define EMAC_IMR_PTZ_Msk                      (_U_(0x1) << EMAC_IMR_PTZ_Pos)                       /**< (EMAC_IMR) Pause Time Zero Mask */
#define EMAC_IMR_PTZ(value)                   (EMAC_IMR_PTZ_Msk & ((value) << EMAC_IMR_PTZ_Pos))  
#define EMAC_IMR_WOL_Pos                      _U_(14)                                              /**< (EMAC_IMR) Wake-On-LAN Position */
#define EMAC_IMR_WOL_Msk                      (_U_(0x1) << EMAC_IMR_WOL_Pos)                       /**< (EMAC_IMR) Wake-On-LAN Mask */
#define EMAC_IMR_WOL(value)                   (EMAC_IMR_WOL_Msk & ((value) << EMAC_IMR_WOL_Pos))  
#define EMAC_IMR_Msk                          _U_(0x00007EFF)                                      /**< (EMAC_IMR) Register Mask  */


/* -------- EMAC_MAN : (EMAC Offset: 0x34) (R/W 32) PHY Maintenance Register -------- */
#define EMAC_MAN_DATA_Pos                     _U_(0)                                               /**< (EMAC_MAN) PHY Transmit or Receive Data Position */
#define EMAC_MAN_DATA_Msk                     (_U_(0xFFFF) << EMAC_MAN_DATA_Pos)                   /**< (EMAC_MAN) PHY Transmit or Receive Data Mask */
#define EMAC_MAN_DATA(value)                  (EMAC_MAN_DATA_Msk & ((value) << EMAC_MAN_DATA_Pos))
#define EMAC_MAN_CODE_Pos                     _U_(16)                                              /**< (EMAC_MAN) Must Be Two Position */
#define EMAC_MAN_CODE_Msk                     (_U_(0x3) << EMAC_MAN_CODE_Pos)                      /**< (EMAC_MAN) Must Be Two Mask */
#define EMAC_MAN_CODE(value)                  (EMAC_MAN_CODE_Msk & ((value) << EMAC_MAN_CODE_Pos))
#define EMAC_MAN_REGA_Pos                     _U_(18)                                              /**< (EMAC_MAN) PHY Register Address Position */
#define EMAC_MAN_REGA_Msk                     (_U_(0x1F) << EMAC_MAN_REGA_Pos)                     /**< (EMAC_MAN) PHY Register Address Mask */
#define EMAC_MAN_REGA(value)                  (EMAC_MAN_REGA_Msk & ((value) << EMAC_MAN_REGA_Pos))
#define EMAC_MAN_PHYA_Pos                     _U_(23)                                              /**< (EMAC_MAN) PHY Address Position */
#define EMAC_MAN_PHYA_Msk                     (_U_(0x1F) << EMAC_MAN_PHYA_Pos)                     /**< (EMAC_MAN) PHY Address Mask */
#define EMAC_MAN_PHYA(value)                  (EMAC_MAN_PHYA_Msk & ((value) << EMAC_MAN_PHYA_Pos))
#define EMAC_MAN_RW_Pos                       _U_(28)                                              /**< (EMAC_MAN) PHY Read/Write Command Position */
#define EMAC_MAN_RW_Msk                       (_U_(0x3) << EMAC_MAN_RW_Pos)                        /**< (EMAC_MAN) PHY Read/Write Command Mask */
#define EMAC_MAN_RW(value)                    (EMAC_MAN_RW_Msk & ((value) << EMAC_MAN_RW_Pos))    
#define EMAC_MAN_SOF_Pos                      _U_(30)                                              /**< (EMAC_MAN) Start of Frame Position */
#define EMAC_MAN_SOF_Msk                      (_U_(0x3) << EMAC_MAN_SOF_Pos)                       /**< (EMAC_MAN) Start of Frame Mask */
#define EMAC_MAN_SOF(value)                   (EMAC_MAN_SOF_Msk & ((value) << EMAC_MAN_SOF_Pos))  
#define EMAC_MAN_Msk                          _U_(0xFFFFFFFF)                                      /**< (EMAC_MAN) Register Mask  */


/* -------- EMAC_PTR : (EMAC Offset: 0x38) (R/W 32) Pause Time Register -------- */
#define EMAC_PTR_PTIME_Pos                    _U_(0)                                               /**< (EMAC_PTR) Pause Time Position */
#define EMAC_PTR_PTIME_Msk                    (_U_(0xFFFF) << EMAC_PTR_PTIME_Pos)                  /**< (EMAC_PTR) Pause Time Mask */
#define EMAC_PTR_PTIME(value)                 (EMAC_PTR_PTIME_Msk & ((value) << EMAC_PTR_PTIME_Pos))
#define EMAC_PTR_Msk                          _U_(0x0000FFFF)                                      /**< (EMAC_PTR) Register Mask  */


