Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/emac.h
/* -------- EMAC_PFR : (EMAC Offset: 0x3C) (R/W 32) Pause Frames Received Register -------- */
#define EMAC_PFR_FROK_Pos                     _U_(0)                                               /**< (EMAC_PFR) Pause Frames Received OK Position */
#define EMAC_PFR_FROK_Msk                     (_U_(0xFFFF) << EMAC_PFR_FROK_Pos)                   /**< (EMAC_PFR) Pause Frames Received OK Mask */
#define EMAC_PFR_FROK(value)                  (EMAC_PFR_FROK_Msk & ((value) << EMAC_PFR_FROK_Pos))
#define EMAC_PFR_Msk                          _U_(0x0000FFFF)                                      /**< (EMAC_PFR) Register Mask  */


/* -------- EMAC_FTO : (EMAC Offset: 0x40) (R/W 32) Frames Transmitted OK Register -------- */
#define EMAC_FTO_FTOK_Pos                     _U_(0)                                               /**< (EMAC_FTO) Frames Transmitted OK Position */
#define EMAC_FTO_FTOK_Msk                     (_U_(0xFFFFFF) << EMAC_FTO_FTOK_Pos)                 /**< (EMAC_FTO) Frames Transmitted OK Mask */
#define EMAC_FTO_FTOK(value)                  (EMAC_FTO_FTOK_Msk & ((value) << EMAC_FTO_FTOK_Pos))
#define EMAC_FTO_Msk                          _U_(0x00FFFFFF)                                      /**< (EMAC_FTO) Register Mask  */


/* -------- EMAC_SCF : (EMAC Offset: 0x44) (R/W 32) Single Collision Frames Register -------- */
#define EMAC_SCF_SCF_Pos                      _U_(0)                                               /**< (EMAC_SCF) Single Collision Frames Position */
#define EMAC_SCF_SCF_Msk                      (_U_(0xFFFF) << EMAC_SCF_SCF_Pos)                    /**< (EMAC_SCF) Single Collision Frames Mask */
#define EMAC_SCF_SCF(value)                   (EMAC_SCF_SCF_Msk & ((value) << EMAC_SCF_SCF_Pos))  
#define EMAC_SCF_Msk                          _U_(0x0000FFFF)                                      /**< (EMAC_SCF) Register Mask  */


/* -------- EMAC_MCF : (EMAC Offset: 0x48) (R/W 32) Multiple Collision Frames Register -------- */
#define EMAC_MCF_MCF_Pos                      _U_(0)                                               /**< (EMAC_MCF) Multicollision Frames Position */
#define EMAC_MCF_MCF_Msk                      (_U_(0xFFFF) << EMAC_MCF_MCF_Pos)                    /**< (EMAC_MCF) Multicollision Frames Mask */
#define EMAC_MCF_MCF(value)                   (EMAC_MCF_MCF_Msk & ((value) << EMAC_MCF_MCF_Pos))  
#define EMAC_MCF_Msk                          _U_(0x0000FFFF)                                      /**< (EMAC_MCF) Register Mask  */


/* -------- EMAC_FRO : (EMAC Offset: 0x4C) (R/W 32) Frames Received OK Register -------- */
#define EMAC_FRO_FROK_Pos                     _U_(0)                                               /**< (EMAC_FRO) Frames Received OK Position */
#define EMAC_FRO_FROK_Msk                     (_U_(0xFFFFFF) << EMAC_FRO_FROK_Pos)                 /**< (EMAC_FRO) Frames Received OK Mask */
#define EMAC_FRO_FROK(value)                  (EMAC_FRO_FROK_Msk & ((value) << EMAC_FRO_FROK_Pos))
#define EMAC_FRO_Msk                          _U_(0x00FFFFFF)                                      /**< (EMAC_FRO) Register Mask  */


/* -------- EMAC_FCSE : (EMAC Offset: 0x50) (R/W 32) Frame Check Sequence Errors Register -------- */
#define EMAC_FCSE_FCSE_Pos                    _U_(0)                                               /**< (EMAC_FCSE) Frame Check Sequence Errors Position */
#define EMAC_FCSE_FCSE_Msk                    (_U_(0xFF) << EMAC_FCSE_FCSE_Pos)                    /**< (EMAC_FCSE) Frame Check Sequence Errors Mask */
#define EMAC_FCSE_FCSE(value)                 (EMAC_FCSE_FCSE_Msk & ((value) << EMAC_FCSE_FCSE_Pos))
#define EMAC_FCSE_Msk                         _U_(0x000000FF)                                      /**< (EMAC_FCSE) Register Mask  */


/* -------- EMAC_ALE : (EMAC Offset: 0x54) (R/W 32) Alignment Errors Register -------- */
#define EMAC_ALE_ALE_Pos                      _U_(0)                                               /**< (EMAC_ALE) Alignment Errors Position */
#define EMAC_ALE_ALE_Msk                      (_U_(0xFF) << EMAC_ALE_ALE_Pos)                      /**< (EMAC_ALE) Alignment Errors Mask */
#define EMAC_ALE_ALE(value)                   (EMAC_ALE_ALE_Msk & ((value) << EMAC_ALE_ALE_Pos))  
#define EMAC_ALE_Msk                          _U_(0x000000FF)                                      /**< (EMAC_ALE) Register Mask  */


/* -------- EMAC_DTF : (EMAC Offset: 0x58) (R/W 32) Deferred Transmission Frames Register -------- */
#define EMAC_DTF_DTF_Pos                      _U_(0)                                               /**< (EMAC_DTF) Deferred Transmission Frames Position */
#define EMAC_DTF_DTF_Msk                      (_U_(0xFFFF) << EMAC_DTF_DTF_Pos)                    /**< (EMAC_DTF) Deferred Transmission Frames Mask */
#define EMAC_DTF_DTF(value)                   (EMAC_DTF_DTF_Msk & ((value) << EMAC_DTF_DTF_Pos))  
#define EMAC_DTF_Msk                          _U_(0x0000FFFF)                                      /**< (EMAC_DTF) Register Mask  */


/* -------- EMAC_LCOL : (EMAC Offset: 0x5C) (R/W 32) Late Collisions Register -------- */
#define EMAC_LCOL_LCOL_Pos                    _U_(0)                                               /**< (EMAC_LCOL) Late Collisions Position */
#define EMAC_LCOL_LCOL_Msk                    (_U_(0xFF) << EMAC_LCOL_LCOL_Pos)                    /**< (EMAC_LCOL) Late Collisions Mask */
#define EMAC_LCOL_LCOL(value)                 (EMAC_LCOL_LCOL_Msk & ((value) << EMAC_LCOL_LCOL_Pos))
#define EMAC_LCOL_Msk                         _U_(0x000000FF)                                      /**< (EMAC_LCOL) Register Mask  */


/* -------- EMAC_ECOL : (EMAC Offset: 0x60) (R/W 32) Excessive Collisions Register -------- */
#define EMAC_ECOL_EXCOL_Pos                   _U_(0)                                               /**< (EMAC_ECOL) Excessive Collisions Position */
#define EMAC_ECOL_EXCOL_Msk                   (_U_(0xFF) << EMAC_ECOL_EXCOL_Pos)                   /**< (EMAC_ECOL) Excessive Collisions Mask */
#define EMAC_ECOL_EXCOL(value)                (EMAC_ECOL_EXCOL_Msk & ((value) << EMAC_ECOL_EXCOL_Pos))
#define EMAC_ECOL_Msk                         _U_(0x000000FF)                                      /**< (EMAC_ECOL) Register Mask  */


/* -------- EMAC_TUND : (EMAC Offset: 0x64) (R/W 32) Transmit Underrun Errors Register -------- */
#define EMAC_TUND_TUND_Pos                    _U_(0)                                               /**< (EMAC_TUND) Transmit Underruns Position */
#define EMAC_TUND_TUND_Msk                    (_U_(0xFF) << EMAC_TUND_TUND_Pos)                    /**< (EMAC_TUND) Transmit Underruns Mask */
#define EMAC_TUND_TUND(value)                 (EMAC_TUND_TUND_Msk & ((value) << EMAC_TUND_TUND_Pos))
#define EMAC_TUND_Msk                         _U_(0x000000FF)                                      /**< (EMAC_TUND) Register Mask  */


/* -------- EMAC_CSE : (EMAC Offset: 0x68) (R/W 32) Carrier Sense Errors Register -------- */
#define EMAC_CSE_CSE_Pos                      _U_(0)                                               /**< (EMAC_CSE) Carrier Sense Errors Position */
#define EMAC_CSE_CSE_Msk                      (_U_(0xFF) << EMAC_CSE_CSE_Pos)                      /**< (EMAC_CSE) Carrier Sense Errors Mask */
#define EMAC_CSE_CSE(value)                   (EMAC_CSE_CSE_Msk & ((value) << EMAC_CSE_CSE_Pos))  
#define EMAC_CSE_Msk                          _U_(0x000000FF)                                      /**< (EMAC_CSE) Register Mask  */


