Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/emac.h
/* -------- EMAC_RRE : (EMAC Offset: 0x6C) (R/W 32) Receive Resource Errors Register -------- */
#define EMAC_RRE_RRE_Pos                      _U_(0)                                               /**< (EMAC_RRE) Receive Resource Errors Position */
#define EMAC_RRE_RRE_Msk                      (_U_(0xFFFF) << EMAC_RRE_RRE_Pos)                    /**< (EMAC_RRE) Receive Resource Errors Mask */
#define EMAC_RRE_RRE(value)                   (EMAC_RRE_RRE_Msk & ((value) << EMAC_RRE_RRE_Pos))  
#define EMAC_RRE_Msk                          _U_(0x0000FFFF)                                      /**< (EMAC_RRE) Register Mask  */


/* -------- EMAC_ROV : (EMAC Offset: 0x70) (R/W 32) Receive Overrun Errors Register -------- */
#define EMAC_ROV_ROVR_Pos                     _U_(0)                                               /**< (EMAC_ROV) Receive Overrun Position */
#define EMAC_ROV_ROVR_Msk                     (_U_(0xFF) << EMAC_ROV_ROVR_Pos)                     /**< (EMAC_ROV) Receive Overrun Mask */
#define EMAC_ROV_ROVR(value)                  (EMAC_ROV_ROVR_Msk & ((value) << EMAC_ROV_ROVR_Pos))
#define EMAC_ROV_Msk                          _U_(0x000000FF)                                      /**< (EMAC_ROV) Register Mask  */


/* -------- EMAC_RSE : (EMAC Offset: 0x74) (R/W 32) Receive Symbol Errors Register -------- */
#define EMAC_RSE_RSE_Pos                      _U_(0)                                               /**< (EMAC_RSE) Receive Symbol Errors Position */
#define EMAC_RSE_RSE_Msk                      (_U_(0xFF) << EMAC_RSE_RSE_Pos)                      /**< (EMAC_RSE) Receive Symbol Errors Mask */
#define EMAC_RSE_RSE(value)                   (EMAC_RSE_RSE_Msk & ((value) << EMAC_RSE_RSE_Pos))  
#define EMAC_RSE_Msk                          _U_(0x000000FF)                                      /**< (EMAC_RSE) Register Mask  */


/* -------- EMAC_ELE : (EMAC Offset: 0x78) (R/W 32) Excessive Length Errors Register -------- */
#define EMAC_ELE_EXL_Pos                      _U_(0)                                               /**< (EMAC_ELE) Excessive Length Errors Position */
#define EMAC_ELE_EXL_Msk                      (_U_(0xFF) << EMAC_ELE_EXL_Pos)                      /**< (EMAC_ELE) Excessive Length Errors Mask */
#define EMAC_ELE_EXL(value)                   (EMAC_ELE_EXL_Msk & ((value) << EMAC_ELE_EXL_Pos))  
#define EMAC_ELE_Msk                          _U_(0x000000FF)                                      /**< (EMAC_ELE) Register Mask  */


/* -------- EMAC_RJA : (EMAC Offset: 0x7C) (R/W 32) Receive Jabbers Register -------- */
#define EMAC_RJA_RJB_Pos                      _U_(0)                                               /**< (EMAC_RJA) Receive Jabbers Position */
#define EMAC_RJA_RJB_Msk                      (_U_(0xFF) << EMAC_RJA_RJB_Pos)                      /**< (EMAC_RJA) Receive Jabbers Mask */
#define EMAC_RJA_RJB(value)                   (EMAC_RJA_RJB_Msk & ((value) << EMAC_RJA_RJB_Pos))  
#define EMAC_RJA_Msk                          _U_(0x000000FF)                                      /**< (EMAC_RJA) Register Mask  */


/* -------- EMAC_USF : (EMAC Offset: 0x80) (R/W 32) Undersize Frames Register -------- */
#define EMAC_USF_USF_Pos                      _U_(0)                                               /**< (EMAC_USF) Undersize Frames Position */
#define EMAC_USF_USF_Msk                      (_U_(0xFF) << EMAC_USF_USF_Pos)                      /**< (EMAC_USF) Undersize Frames Mask */
#define EMAC_USF_USF(value)                   (EMAC_USF_USF_Msk & ((value) << EMAC_USF_USF_Pos))  
#define EMAC_USF_Msk                          _U_(0x000000FF)                                      /**< (EMAC_USF) Register Mask  */


/* -------- EMAC_STE : (EMAC Offset: 0x84) (R/W 32) SQE Test Errors Register -------- */
#define EMAC_STE_SQER_Pos                     _U_(0)                                               /**< (EMAC_STE) SQE Test Errors Position */
#define EMAC_STE_SQER_Msk                     (_U_(0xFF) << EMAC_STE_SQER_Pos)                     /**< (EMAC_STE) SQE Test Errors Mask */
#define EMAC_STE_SQER(value)                  (EMAC_STE_SQER_Msk & ((value) << EMAC_STE_SQER_Pos))
#define EMAC_STE_Msk                          _U_(0x000000FF)                                      /**< (EMAC_STE) Register Mask  */


/* -------- EMAC_RLE : (EMAC Offset: 0x88) (R/W 32) Received Length Field Mismatch Register -------- */
#define EMAC_RLE_RLFM_Pos                     _U_(0)                                               /**< (EMAC_RLE) Receive Length Field Mismatch Position */
#define EMAC_RLE_RLFM_Msk                     (_U_(0xFF) << EMAC_RLE_RLFM_Pos)                     /**< (EMAC_RLE) Receive Length Field Mismatch Mask */
#define EMAC_RLE_RLFM(value)                  (EMAC_RLE_RLFM_Msk & ((value) << EMAC_RLE_RLFM_Pos))
#define EMAC_RLE_Msk                          _U_(0x000000FF)                                      /**< (EMAC_RLE) Register Mask  */


/* -------- EMAC_TPF : (EMAC Offset: 0x8C) (R/W 32) Transmitted Pause Frames Register -------- */
#define EMAC_TPF_TPF_Pos                      _U_(0)                                               /**< (EMAC_TPF) Transmitted Pause Frames Position */
#define EMAC_TPF_TPF_Msk                      (_U_(0xFFFF) << EMAC_TPF_TPF_Pos)                    /**< (EMAC_TPF) Transmitted Pause Frames Mask */
#define EMAC_TPF_TPF(value)                   (EMAC_TPF_TPF_Msk & ((value) << EMAC_TPF_TPF_Pos))  
#define EMAC_TPF_Msk                          _U_(0x0000FFFF)                                      /**< (EMAC_TPF) Register Mask  */


/* -------- EMAC_HRB : (EMAC Offset: 0x90) (R/W 32) Hash Register Bottom [31:0] Register -------- */
#define EMAC_HRB_ADDR_Pos                     _U_(0)                                               /**< (EMAC_HRB) Hash Address Bottom Position */
#define EMAC_HRB_ADDR_Msk                     (_U_(0xFFFFFFFF) << EMAC_HRB_ADDR_Pos)               /**< (EMAC_HRB) Hash Address Bottom Mask */
#define EMAC_HRB_ADDR(value)                  (EMAC_HRB_ADDR_Msk & ((value) << EMAC_HRB_ADDR_Pos))
#define EMAC_HRB_Msk                          _U_(0xFFFFFFFF)                                      /**< (EMAC_HRB) Register Mask  */


/* -------- EMAC_HRT : (EMAC Offset: 0x94) (R/W 32) Hash Register Top [63:32] Register -------- */
#define EMAC_HRT_ADDR_Pos                     _U_(0)                                               /**< (EMAC_HRT) Hash Address Top Position */
#define EMAC_HRT_ADDR_Msk                     (_U_(0xFFFFFFFF) << EMAC_HRT_ADDR_Pos)               /**< (EMAC_HRT) Hash Address Top Mask */
#define EMAC_HRT_ADDR(value)                  (EMAC_HRT_ADDR_Msk & ((value) << EMAC_HRT_ADDR_Pos))
#define EMAC_HRT_Msk                          _U_(0xFFFFFFFF)                                      /**< (EMAC_HRT) Register Mask  */


/* -------- EMAC_TID : (EMAC Offset: 0xB8) (R/W 32) Type ID Checking Register -------- */
#define EMAC_TID_TID_Pos                      _U_(0)                                               /**< (EMAC_TID) Type ID Checking Position */
#define EMAC_TID_TID_Msk                      (_U_(0xFFFF) << EMAC_TID_TID_Pos)                    /**< (EMAC_TID) Type ID Checking Mask */
#define EMAC_TID_TID(value)                   (EMAC_TID_TID_Msk & ((value) << EMAC_TID_TID_Pos))  
#define EMAC_TID_Msk                          _U_(0x0000FFFF)                                      /**< (EMAC_TID) Register Mask  */


