Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/emac.h
/* -------- EMAC_TPQ : (EMAC Offset: 0xBC) (R/W 32) Transmit Pause Quantum Register -------- */
#define EMAC_TPQ_TPQ_Pos                      _U_(0)                                               /**< (EMAC_TPQ) Transmit Pause Quantum Position */
#define EMAC_TPQ_TPQ_Msk                      (_U_(0xFFFF) << EMAC_TPQ_TPQ_Pos)                    /**< (EMAC_TPQ) Transmit Pause Quantum Mask */
#define EMAC_TPQ_TPQ(value)                   (EMAC_TPQ_TPQ_Msk & ((value) << EMAC_TPQ_TPQ_Pos))  
#define EMAC_TPQ_Msk                          _U_(0x0000FFFF)                                      /**< (EMAC_TPQ) Register Mask  */


/* -------- EMAC_USRIO : (EMAC Offset: 0xC0) (R/W 32) User Input/Output Register -------- */
#define EMAC_USRIO_RMII_Pos                   _U_(0)                                               /**< (EMAC_USRIO) Reduced MII Position */
#define EMAC_USRIO_RMII_Msk                   (_U_(0x1) << EMAC_USRIO_RMII_Pos)                    /**< (EMAC_USRIO) Reduced MII Mask */
#define EMAC_USRIO_RMII(value)                (EMAC_USRIO_RMII_Msk & ((value) << EMAC_USRIO_RMII_Pos))
#define EMAC_USRIO_CLKEN_Pos                  _U_(1)                                               /**< (EMAC_USRIO) Clock Enable Position */
#define EMAC_USRIO_CLKEN_Msk                  (_U_(0x1) << EMAC_USRIO_CLKEN_Pos)                   /**< (EMAC_USRIO) Clock Enable Mask */
#define EMAC_USRIO_CLKEN(value)               (EMAC_USRIO_CLKEN_Msk & ((value) << EMAC_USRIO_CLKEN_Pos))
#define EMAC_USRIO_Msk                        _U_(0x00000003)                                      /**< (EMAC_USRIO) Register Mask  */


/* -------- EMAC_WOL : (EMAC Offset: 0xC4) (R/W 32) Wake-on-LAN Register -------- */
#define EMAC_WOL_IP_Pos                       _U_(0)                                               /**< (EMAC_WOL) ARP Request IP Address Position */
#define EMAC_WOL_IP_Msk                       (_U_(0xFFFF) << EMAC_WOL_IP_Pos)                     /**< (EMAC_WOL) ARP Request IP Address Mask */
#define EMAC_WOL_IP(value)                    (EMAC_WOL_IP_Msk & ((value) << EMAC_WOL_IP_Pos))    
#define EMAC_WOL_MAG_Pos                      _U_(16)                                              /**< (EMAC_WOL) Magic Packet Event Enable Position */
#define EMAC_WOL_MAG_Msk                      (_U_(0x1) << EMAC_WOL_MAG_Pos)                       /**< (EMAC_WOL) Magic Packet Event Enable Mask */
#define EMAC_WOL_MAG(value)                   (EMAC_WOL_MAG_Msk & ((value) << EMAC_WOL_MAG_Pos))  
#define EMAC_WOL_ARP_Pos                      _U_(17)                                              /**< (EMAC_WOL) ARP Request IP Address Position */
#define EMAC_WOL_ARP_Msk                      (_U_(0x1) << EMAC_WOL_ARP_Pos)                       /**< (EMAC_WOL) ARP Request IP Address Mask */
#define EMAC_WOL_ARP(value)                   (EMAC_WOL_ARP_Msk & ((value) << EMAC_WOL_ARP_Pos))  
#define EMAC_WOL_SA1_Pos                      _U_(18)                                              /**< (EMAC_WOL) Specific Address Register 1 Event Enable Position */
#define EMAC_WOL_SA1_Msk                      (_U_(0x1) << EMAC_WOL_SA1_Pos)                       /**< (EMAC_WOL) Specific Address Register 1 Event Enable Mask */
#define EMAC_WOL_SA1(value)                   (EMAC_WOL_SA1_Msk & ((value) << EMAC_WOL_SA1_Pos))  
#define EMAC_WOL_MTI_Pos                      _U_(19)                                              /**< (EMAC_WOL) Multicast Hash Event Enable Position */
#define EMAC_WOL_MTI_Msk                      (_U_(0x1) << EMAC_WOL_MTI_Pos)                       /**< (EMAC_WOL) Multicast Hash Event Enable Mask */
#define EMAC_WOL_MTI(value)                   (EMAC_WOL_MTI_Msk & ((value) << EMAC_WOL_MTI_Pos))  
#define EMAC_WOL_Msk                          _U_(0x000FFFFF)                                      /**< (EMAC_WOL) Register Mask  */

#define EMAC_WOL_SA_Pos                       _U_(18)                                              /**< (EMAC_WOL Position) Specific Address Register x Event Enable */
#define EMAC_WOL_SA_Msk                       (_U_(0x1) << EMAC_WOL_SA_Pos)                        /**< (EMAC_WOL Mask) SA */
#define EMAC_WOL_SA(value)                    (EMAC_WOL_SA_Msk & ((value) << EMAC_WOL_SA_Pos))     

/* -------- EMAC_VERSION : (EMAC Offset: 0xFC) ( R/ 32) Version Register -------- */
#define EMAC_VERSION_VERSION_Pos              _U_(0)                                               /**< (EMAC_VERSION) Hardware Module Version Position */
#define EMAC_VERSION_VERSION_Msk              (_U_(0xFFF) << EMAC_VERSION_VERSION_Pos)             /**< (EMAC_VERSION) Hardware Module Version Mask */
#define EMAC_VERSION_VERSION(value)           (EMAC_VERSION_VERSION_Msk & ((value) << EMAC_VERSION_VERSION_Pos))
#define EMAC_VERSION_MFN_Pos                  _U_(16)                                              /**< (EMAC_VERSION) Metal Fix Number Position */
#define EMAC_VERSION_MFN_Msk                  (_U_(0x7) << EMAC_VERSION_MFN_Pos)                   /**< (EMAC_VERSION) Metal Fix Number Mask */
#define EMAC_VERSION_MFN(value)               (EMAC_VERSION_MFN_Msk & ((value) << EMAC_VERSION_MFN_Pos))
#define EMAC_VERSION_Msk                      _U_(0x00070FFF)                                      /**< (EMAC_VERSION) Register Mask  */


/** \brief EMAC register offsets definitions */
#define EMAC_SAxB_REG_OFST             (0x00)              /**< (EMAC_SAxB) Specific Address X Bottom Register Offset */
#define EMAC_SAxT_REG_OFST             (0x04)              /**< (EMAC_SAxT) Specific Address X Top Register Offset */
#define EMAC_NCR_REG_OFST              (0x00)              /**< (EMAC_NCR) Network Control Register Offset */
#define EMAC_NCFGR_REG_OFST            (0x04)              /**< (EMAC_NCFGR) Network Configuration Register Offset */
#define EMAC_NSR_REG_OFST              (0x08)              /**< (EMAC_NSR) Network Status Register Offset */
#define EMAC_TSR_REG_OFST              (0x14)              /**< (EMAC_TSR) Transmit Status Register Offset */
#define EMAC_RBQP_REG_OFST             (0x18)              /**< (EMAC_RBQP) Receive Buffer Queue Pointer Register Offset */
#define EMAC_TBQP_REG_OFST             (0x1C)              /**< (EMAC_TBQP) Transmit Buffer Queue Pointer Register Offset */
#define EMAC_RSR_REG_OFST              (0x20)              /**< (EMAC_RSR) Receive Status Register Offset */
#define EMAC_ISR_REG_OFST              (0x24)              /**< (EMAC_ISR) Interrupt Status Register Offset */
#define EMAC_IER_REG_OFST              (0x28)              /**< (EMAC_IER) Interrupt Enable Register Offset */
#define EMAC_IDR_REG_OFST              (0x2C)              /**< (EMAC_IDR) Interrupt Disable Register Offset */
#define EMAC_IMR_REG_OFST              (0x30)              /**< (EMAC_IMR) Interrupt Mask Register Offset */
#define EMAC_MAN_REG_OFST              (0x34)              /**< (EMAC_MAN) PHY Maintenance Register Offset */
#define EMAC_PTR_REG_OFST              (0x38)              /**< (EMAC_PTR) Pause Time Register Offset */
#define EMAC_PFR_REG_OFST              (0x3C)              /**< (EMAC_PFR) Pause Frames Received Register Offset */
#define EMAC_FTO_REG_OFST              (0x40)              /**< (EMAC_FTO) Frames Transmitted OK Register Offset */
#define EMAC_SCF_REG_OFST              (0x44)              /**< (EMAC_SCF) Single Collision Frames Register Offset */
#define EMAC_MCF_REG_OFST              (0x48)              /**< (EMAC_MCF) Multiple Collision Frames Register Offset */
#define EMAC_FRO_REG_OFST              (0x4C)              /**< (EMAC_FRO) Frames Received OK Register Offset */
#define EMAC_FCSE_REG_OFST             (0x50)              /**< (EMAC_FCSE) Frame Check Sequence Errors Register Offset */
#define EMAC_ALE_REG_OFST              (0x54)              /**< (EMAC_ALE) Alignment Errors Register Offset */
#define EMAC_DTF_REG_OFST              (0x58)              /**< (EMAC_DTF) Deferred Transmission Frames Register Offset */
#define EMAC_LCOL_REG_OFST             (0x5C)              /**< (EMAC_LCOL) Late Collisions Register Offset */
#define EMAC_ECOL_REG_OFST             (0x60)              /**< (EMAC_ECOL) Excessive Collisions Register Offset */
#define EMAC_TUND_REG_OFST             (0x64)              /**< (EMAC_TUND) Transmit Underrun Errors Register Offset */
#define EMAC_CSE_REG_OFST              (0x68)              /**< (EMAC_CSE) Carrier Sense Errors Register Offset */
#define EMAC_RRE_REG_OFST              (0x6C)              /**< (EMAC_RRE) Receive Resource Errors Register Offset */
#define EMAC_ROV_REG_OFST              (0x70)              /**< (EMAC_ROV) Receive Overrun Errors Register Offset */
#define EMAC_RSE_REG_OFST              (0x74)              /**< (EMAC_RSE) Receive Symbol Errors Register Offset */
#define EMAC_ELE_REG_OFST              (0x78)              /**< (EMAC_ELE) Excessive Length Errors Register Offset */
#define EMAC_RJA_REG_OFST              (0x7C)              /**< (EMAC_RJA) Receive Jabbers Register Offset */
#define EMAC_USF_REG_OFST              (0x80)              /**< (EMAC_USF) Undersize Frames Register Offset */
#define EMAC_STE_REG_OFST              (0x84)              /**< (EMAC_STE) SQE Test Errors Register Offset */
#define EMAC_RLE_REG_OFST              (0x88)              /**< (EMAC_RLE) Received Length Field Mismatch Register Offset */
#define EMAC_TPF_REG_OFST              (0x8C)              /**< (EMAC_TPF) Transmitted Pause Frames Register Offset */
#define EMAC_HRB_REG_OFST              (0x90)              /**< (EMAC_HRB) Hash Register Bottom [31:0] Register Offset */
#define EMAC_HRT_REG_OFST              (0x94)              /**< (EMAC_HRT) Hash Register Top [63:32] Register Offset */
#define EMAC_TID_REG_OFST              (0xB8)              /**< (EMAC_TID) Type ID Checking Register Offset */
#define EMAC_TPQ_REG_OFST              (0xBC)              /**< (EMAC_TPQ) Transmit Pause Quantum Register Offset */
#define EMAC_USRIO_REG_OFST            (0xC0)              /**< (EMAC_USRIO) User Input/Output Register Offset */
#define EMAC_WOL_REG_OFST              (0xC4)              /**< (EMAC_WOL) Wake-on-LAN Register Offset */
#define EMAC_VERSION_REG_OFST          (0xFC)              /**< (EMAC_VERSION) Version Register Offset */

