Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/emac.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief EMAC_SA register API structure */
typedef struct
{
  __IO  uint32_t                       EMAC_SAxB;          /**< Offset: 0x00 (R/W  32) Specific Address X Bottom Register */
  __IO  uint32_t                       EMAC_SAxT;          /**< Offset: 0x04 (R/W  32) Specific Address X Top Register */
} emac_sa_registers_t;

#define EMAC_SA_NUMBER _U_(4)

/** \brief EMAC register API structure */
typedef struct
{
  __IO  uint32_t                       EMAC_NCR;           /**< Offset: 0x00 (R/W  32) Network Control Register */
  __IO  uint32_t                       EMAC_NCFGR;         /**< Offset: 0x04 (R/W  32) Network Configuration Register */
  __I   uint32_t                       EMAC_NSR;           /**< Offset: 0x08 (R/   32) Network Status Register */
  __I   uint8_t                        Reserved1[0x08];
  __IO  uint32_t                       EMAC_TSR;           /**< Offset: 0x14 (R/W  32) Transmit Status Register */
  __IO  uint32_t                       EMAC_RBQP;          /**< Offset: 0x18 (R/W  32) Receive Buffer Queue Pointer Register */
  __IO  uint32_t                       EMAC_TBQP;          /**< Offset: 0x1C (R/W  32) Transmit Buffer Queue Pointer Register */
  __IO  uint32_t                       EMAC_RSR;           /**< Offset: 0x20 (R/W  32) Receive Status Register */
  __IO  uint32_t                       EMAC_ISR;           /**< Offset: 0x24 (R/W  32) Interrupt Status Register */
  __O   uint32_t                       EMAC_IER;           /**< Offset: 0x28 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       EMAC_IDR;           /**< Offset: 0x2C ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       EMAC_IMR;           /**< Offset: 0x30 (R/   32) Interrupt Mask Register */
  __IO  uint32_t                       EMAC_MAN;           /**< Offset: 0x34 (R/W  32) PHY Maintenance Register */
  __IO  uint32_t                       EMAC_PTR;           /**< Offset: 0x38 (R/W  32) Pause Time Register */
  __IO  uint32_t                       EMAC_PFR;           /**< Offset: 0x3C (R/W  32) Pause Frames Received Register */
  __IO  uint32_t                       EMAC_FTO;           /**< Offset: 0x40 (R/W  32) Frames Transmitted OK Register */
  __IO  uint32_t                       EMAC_SCF;           /**< Offset: 0x44 (R/W  32) Single Collision Frames Register */
  __IO  uint32_t                       EMAC_MCF;           /**< Offset: 0x48 (R/W  32) Multiple Collision Frames Register */
  __IO  uint32_t                       EMAC_FRO;           /**< Offset: 0x4C (R/W  32) Frames Received OK Register */
  __IO  uint32_t                       EMAC_FCSE;          /**< Offset: 0x50 (R/W  32) Frame Check Sequence Errors Register */
  __IO  uint32_t                       EMAC_ALE;           /**< Offset: 0x54 (R/W  32) Alignment Errors Register */
  __IO  uint32_t                       EMAC_DTF;           /**< Offset: 0x58 (R/W  32) Deferred Transmission Frames Register */
  __IO  uint32_t                       EMAC_LCOL;          /**< Offset: 0x5C (R/W  32) Late Collisions Register */
  __IO  uint32_t                       EMAC_ECOL;          /**< Offset: 0x60 (R/W  32) Excessive Collisions Register */
  __IO  uint32_t                       EMAC_TUND;          /**< Offset: 0x64 (R/W  32) Transmit Underrun Errors Register */
  __IO  uint32_t                       EMAC_CSE;           /**< Offset: 0x68 (R/W  32) Carrier Sense Errors Register */
  __IO  uint32_t                       EMAC_RRE;           /**< Offset: 0x6C (R/W  32) Receive Resource Errors Register */
  __IO  uint32_t                       EMAC_ROV;           /**< Offset: 0x70 (R/W  32) Receive Overrun Errors Register */
  __IO  uint32_t                       EMAC_RSE;           /**< Offset: 0x74 (R/W  32) Receive Symbol Errors Register */
  __IO  uint32_t                       EMAC_ELE;           /**< Offset: 0x78 (R/W  32) Excessive Length Errors Register */
  __IO  uint32_t                       EMAC_RJA;           /**< Offset: 0x7C (R/W  32) Receive Jabbers Register */
  __IO  uint32_t                       EMAC_USF;           /**< Offset: 0x80 (R/W  32) Undersize Frames Register */
  __IO  uint32_t                       EMAC_STE;           /**< Offset: 0x84 (R/W  32) SQE Test Errors Register */
  __IO  uint32_t                       EMAC_RLE;           /**< Offset: 0x88 (R/W  32) Received Length Field Mismatch Register */
  __IO  uint32_t                       EMAC_TPF;           /**< Offset: 0x8C (R/W  32) Transmitted Pause Frames Register */
  __IO  uint32_t                       EMAC_HRB;           /**< Offset: 0x90 (R/W  32) Hash Register Bottom [31:0] Register */
  __IO  uint32_t                       EMAC_HRT;           /**< Offset: 0x94 (R/W  32) Hash Register Top [63:32] Register */
        emac_sa_registers_t            EMAC_SA[EMAC_SA_NUMBER]; /**< Offset: 0x98  */
  __IO  uint32_t                       EMAC_TID;           /**< Offset: 0xB8 (R/W  32) Type ID Checking Register */
  __IO  uint32_t                       EMAC_TPQ;           /**< Offset: 0xBC (R/W  32) Transmit Pause Quantum Register */
  __IO  uint32_t                       EMAC_USRIO;         /**< Offset: 0xC0 (R/W  32) User Input/Output Register */
  __IO  uint32_t                       EMAC_WOL;           /**< Offset: 0xC4 (R/W  32) Wake-on-LAN Register */
  __I   uint8_t                        Reserved2[0x34];
  __I   uint32_t                       EMAC_VERSION;       /**< Offset: 0xFC (R/   32) Version Register */
} emac_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAM9X_EMAC_COMPONENT_H_ */
